//=============================================================================
//
// 2D矩形の衝突判定クラス(collision_rectangle2D.h)
// Author : 唐﨑結斗
// 概要 : 2D矩形の衝突判定生成を行う
//
//=============================================================================
#ifndef _COLLISION_RECTANGLE2D_H_		// このマクロ定義がされてなかったら
#define _COLLISION_RECTANGLE2D_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "collision.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CLine;

//=============================================================================
// 衝突判定クラス
// Author : 唐﨑結斗
// 概要 : 衝突判定クラス生成を行う
//=============================================================================
class CCollision_Rectangle2D : public CCollision
{
public:
	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CCollision_Rectangle2D *Create();			// インスタンスの生成

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	explicit CCollision_Rectangle2D();
	virtual ~CCollision_Rectangle2D();

	//--------------------------------------------------------------------
	// 純粋仮想関数
	//--------------------------------------------------------------------
	HRESULT Init() override;													// 初期化
	void Uninit() override;														// 終了
	void Update() override;														// 更新
	void Draw() override;														// 描画
	bool Collision(CObject::EObjectType objeType, bool bExtrude) override;		// 当たり判定	
	bool ToRectangle(CCollision *pTarget, bool bExtrude);						// 矩形との当たり判定

#ifdef _DEBUG
	void SetLine();					// ラインの設定
#endif // _DEBUG

private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
#ifdef _DEBUG
	CLine **m_pLine;		// ライン情報
	D3DXCOLOR lineCol;		// ラインの色
#endif // _DEBUG
};

#endif
