//=============================================================================
//
// タイトルクラス(title.h)
// Author : 唐﨑結斗
// 概要 : タイトルクラスの管理を行う
//
//=============================================================================
#ifndef _TITLE_H_		// このマクロ定義がされてなかったら
#define _TITLE_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "scene_mode.h"
#include "object2D.h"

#include <vector>

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CObject2D;
class CBG;

//=============================================================================
// シーンモードクラス
// Author : 唐﨑結斗
// 概要 : シーンモード生成を行うクラス
//=============================================================================
class CTitle : public CSceneMode
{
public:
	enum ETitleBehavior
	{
		TITLE_LOGOSKIP,
		TITLE_PRESS_ENTER,
		TITLE_SELECT,
		TITLE_MAX,
		TITLE_NONE
	};

	enum ESelect
	{
		SELECT_GAME,
		SELECT_TUTORIAL,
		SELECT_MAX
	};

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CTitle();
	~CTitle() override;

	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update() override;		// 更新
	void Draw() override;		// 描画

private:
	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------

	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	std::vector<CObject2D*> m_titleLogo;
	std::vector<CObject2D*> m_selectLogo;
	CObject2D *m_pPressEnter;
	CObject2D *m_pSumou;
	CBG *m_pBg;
	ETitleBehavior m_titleBehavior;
	int m_select;
	int m_rikishiCounter;
	int m_titleLogoCounter;
	int m_walkCounter;
	bool m_bOnce;
};

#endif


